FemDesign.StructureGrid.Storey.#ctor
Parameterless constructor for serialization

FemDesign.StructureGrid.Storey.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Vector3d,System.Double,System.Double,System.String)
Internal constructor.
origo: Origo of storey.
direction: Direction of storey x'-axis. Optional, default value isGCS x-axis.
dimensionX: Dimension in x'-direction.
dimensionY: Dimension in y'-direction.
name: Name of storey.